dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_reg.h
/** \brief 24D4, Comparator Mask Register 2 */
#define MCDS_TCXWD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA0124D4u)
/** Alias (User Manual Name) for MCDS_TCXWD2_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD2_HMSK.
*/
#define MCDS_TCXWDHMSK2 (MCDS_TCXWD2_HMSK)

/** \brief 24DC, Comparator Sign Register 2 */
#define MCDS_TCXWD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA0124DCu)
/** Alias (User Manual Name) for MCDS_TCXWD2_SGN.
* To use register names with standard convension, please use MCDS_TCXWD2_SGN.
*/
#define MCDS_TCXWDSGN2 (MCDS_TCXWD2_SGN)

/** \brief 24E0, Comparator Bound Register 3 */
#define MCDS_TCXWD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA0124E0u)
/** Alias (User Manual Name) for MCDS_TCXWD3_BND.
* To use register names with standard convension, please use MCDS_TCXWD3_BND.
*/
#define MCDS_TCXWDBND3 (MCDS_TCXWD3_BND)

/** \brief 24E4, Comparator Bound Register 3 */
#define MCDS_TCXWD3_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA0124E4u)
/** Alias (User Manual Name) for MCDS_TCXWD3_HBND.
* To use register names with standard convension, please use MCDS_TCXWD3_HBND.
*/
#define MCDS_TCXWDHBND3 (MCDS_TCXWD3_HBND)

/** \brief 24E8, Comparator Range Register 3 */
#define MCDS_TCXWD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA0124E8u)
/** Alias (User Manual Name) for MCDS_TCXWD3_RNG.
* To use register names with standard convension, please use MCDS_TCXWD3_RNG.
*/
#define MCDS_TCXWDRNG3 (MCDS_TCXWD3_RNG)

/** \brief 24EC, Comparator Range Register 3 */
#define MCDS_TCXWD3_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA0124ECu)
/** Alias (User Manual Name) for MCDS_TCXWD3_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD3_HRNG.
*/
#define MCDS_TCXWDHRNG3 (MCDS_TCXWD3_HRNG)

/** \brief 24F0, Comparator Mask Register 3 */
#define MCDS_TCXWD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA0124F0u)
/** Alias (User Manual Name) for MCDS_TCXWD3_MSK.
* To use register names with standard convension, please use MCDS_TCXWD3_MSK.
*/
#define MCDS_TCXWDMSK3 (MCDS_TCXWD3_MSK)

/** \brief 24F4, Comparator Mask Register 3 */
#define MCDS_TCXWD3_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA0124F4u)
/** Alias (User Manual Name) for MCDS_TCXWD3_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD3_HMSK.
*/
#define MCDS_TCXWDHMSK3 (MCDS_TCXWD3_HMSK)

/** \brief 24FC, Comparator Sign Register 3 */
#define MCDS_TCXWD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA0124FCu)
/** Alias (User Manual Name) for MCDS_TCXWD3_SGN.
* To use register names with standard convension, please use MCDS_TCXWD3_SGN.
*/
#define MCDS_TCXWDSGN3 (MCDS_TCXWD3_SGN)

/** \brief 2500, Comparator Bound Register 0 */
#define MCDS_TCXAC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012500u)
/** Alias (User Manual Name) for MCDS_TCXAC0_BND.
* To use register names with standard convension, please use MCDS_TCXAC0_BND.
*/
#define MCDS_TCXACBND0 (MCDS_TCXAC0_BND)

/** \brief 2504, Comparator Range Register 0 */
#define MCDS_TCXAC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012504u)
/** Alias (User Manual Name) for MCDS_TCXAC0_RNG.
* To use register names with standard convension, please use MCDS_TCXAC0_RNG.
*/
#define MCDS_TCXACRNG0 (MCDS_TCXAC0_RNG)

/** \brief 2508, Comparator Mask Register 0 */
#define MCDS_TCXAC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012508u)
/** Alias (User Manual Name) for MCDS_TCXAC0_MSK.
* To use register names with standard convension, please use MCDS_TCXAC0_MSK.
*/
#define MCDS_TCXACMSK0 (MCDS_TCXAC0_MSK)

/** \brief 2510, Comparator Bound Register 1 */
#define MCDS_TCXAC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012510u)
/** Alias (User Manual Name) for MCDS_TCXAC1_BND.
* To use register names with standard convension, please use MCDS_TCXAC1_BND.
*/
#define MCDS_TCXACBND1 (MCDS_TCXAC1_BND)

/** \brief 2514, Comparator Range Register 1 */
#define MCDS_TCXAC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012514u)
/** Alias (User Manual Name) for MCDS_TCXAC1_RNG.
* To use register names with standard convension, please use MCDS_TCXAC1_RNG.
*/
#define MCDS_TCXACRNG1 (MCDS_TCXAC1_RNG)

/** \brief 2518, Comparator Mask Register 1 */
#define MCDS_TCXAC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012518u)
/** Alias (User Manual Name) for MCDS_TCXAC1_MSK.
* To use register names with standard convension, please use MCDS_TCXAC1_MSK.
*/
#define MCDS_TCXACMSK1 (MCDS_TCXAC1_MSK)

/** \brief 2520, Comparator Bound Register 2 */
#define MCDS_TCXAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012520u)
/** Alias (User Manual Name) for MCDS_TCXAC2_BND.
* To use register names with standard convension, please use MCDS_TCXAC2_BND.
*/
#define MCDS_TCXACBND2 (MCDS_TCXAC2_BND)

/** \brief 2524, Comparator Range Register 2 */
#define MCDS_TCXAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012524u)
/** Alias (User Manual Name) for MCDS_TCXAC2_RNG.
* To use register names with standard convension, please use MCDS_TCXAC2_RNG.
*/
#define MCDS_TCXACRNG2 (MCDS_TCXAC2_RNG)

/** \brief 2528, Comparator Mask Register 2 */
#define MCDS_TCXAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012528u)
/** Alias (User Manual Name) for MCDS_TCXAC2_MSK.
* To use register names with standard convension, please use MCDS_TCXAC2_MSK.
*/
#define MCDS_TCXACMSK2 (MCDS_TCXAC2_MSK)

/** \brief 2530, Comparator Bound Register 3 */
#define MCDS_TCXAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012530u)
/** Alias (User Manual Name) for MCDS_TCXAC3_BND.
* To use register names with standard convension, please use MCDS_TCXAC3_BND.
*/
#define MCDS_TCXACBND3 (MCDS_TCXAC3_BND)

/** \brief 2534, Comparator Range Register 3 */
#define MCDS_TCXAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012534u)
/** Alias (User Manual Name) for MCDS_TCXAC3_RNG.
* To use register names with standard convension, please use MCDS_TCXAC3_RNG.
*/
#define MCDS_TCXACRNG3 (MCDS_TCXAC3_RNG)

/** \brief 2538, Comparator Mask Register 3 */
#define MCDS_TCXAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012538u)
/** Alias (User Manual Name) for MCDS_TCXAC3_MSK.
* To use register names with standard convension, please use MCDS_TCXAC3_MSK.
*/
#define MCDS_TCXACMSK3 (MCDS_TCXAC3_MSK)

/** \brief 2580, DTU FIFOs Fill Level */
#define MCDS_TCXDTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXDTUFLV*)0xFA012580u)

/** \brief 2800, Event Definition Register 0 */
#define MCDS_TCXEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012800u)

/** \brief 2804, Event Definition Register 1 */
#define MCDS_TCXEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012804u)

/** \brief 2808, Event Definition Register 2 */
#define MCDS_TCXEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012808u)

/** \brief 280C, Event Definition Register 3 */
#define MCDS_TCXEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01280Cu)

/** \brief 2810, Event Definition Register 4 */
#define MCDS_TCXEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012810u)

/** \brief 2814, Event Definition Register 5 */
#define MCDS_TCXEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012814u)

