dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_reg.h
/** \brief 2818, Event Definition Register 6 */
#define MCDS_TCXEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012818u)

/** \brief 281C, Event Definition Register 7 */
#define MCDS_TCXEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01281Cu)

/** \brief 2820, Event Definition Register 8 */
#define MCDS_TCXEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012820u)

/** \brief 2824, Event Definition Register 9 */
#define MCDS_TCXEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012824u)

/** \brief 2828, Event Definition Register 10 */
#define MCDS_TCXEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012828u)

/** \brief 282C, Event Definition Register 11 */
#define MCDS_TCXEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01282Cu)

/** \brief 2830, Event Definition Register 12 */
#define MCDS_TCXEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012830u)

/** \brief 2834, Event Definition Register 13 */
#define MCDS_TCXEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012834u)

/** \brief 2838, Event Definition Register 14 */
#define MCDS_TCXEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012838u)

/** \brief 283C, Event Definition Register 15 */
#define MCDS_TCXEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01283Cu)

/** \brief 2880, Action Definition Register 0 */
#define MCDS_TCXACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012880u)

/** \brief 2884, Action Definition Register 1 */
#define MCDS_TCXACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012884u)

/** \brief 2888, Action Definition Register 2 */
#define MCDS_TCXACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012888u)

/** \brief 288C, Action Definition Register 3 */
#define MCDS_TCXACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA01288Cu)

/** \brief 2890, Action Definition Register 4 */
#define MCDS_TCXACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012890u)

/** \brief 2894, Action Definition Register 5 */
#define MCDS_TCXACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012894u)

/** \brief 2898, Action Definition Register 6 */
#define MCDS_TCXACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012898u)

/** \brief 289C, Action Definition Register 7 */
#define MCDS_TCXACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA01289Cu)

/** \brief 28A0, Action Definition Register 8 */
#define MCDS_TCXACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128A0u)

/** \brief 28A4, Action Definition Register 9 */
#define MCDS_TCXACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128A4u)

/** \brief 28A8, Action Definition Register 10 */
#define MCDS_TCXACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128A8u)

/** \brief 28AC, Action Definition Register 11 */
#define MCDS_TCXACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128ACu)

/** \brief 28B0, Action Definition Register 12 */
#define MCDS_TCXACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128B0u)

/** \brief 28B4, Action Definition Register 13 */
#define MCDS_TCXACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128B4u)

/** \brief 28B8, Action Definition Register 14 */
#define MCDS_TCXACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128B8u)

/** \brief 28BC, Action Definition Register 15 */
#define MCDS_TCXACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128BCu)

/** \brief 28C0, Action Definition Register 16 */
#define MCDS_TCXACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128C0u)

/** \brief 28C4, Action Definition Register 17 */
#define MCDS_TCXACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128C4u)

/** \brief 28C8, Action Definition Register 18 */
#define MCDS_TCXACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128C8u)

/** \brief 28CC, Action Definition Register 19 */
#define MCDS_TCXACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128CCu)

/** \brief 28D0, Action Definition Register 20 */
#define MCDS_TCXACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128D0u)

/** \brief 28D4, Action Definition Register 21 */
#define MCDS_TCXACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128D4u)

/** \brief 28D8, Action Definition Register 22 */
#define MCDS_TCXACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128D8u)

/** \brief 28DC, Action Definition Register 23 */
#define MCDS_TCXACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128DCu)

/** \brief 2C00, Comparator Bound Register 0 */
#define MCDS_TCXID0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_BND*)0xFA012C00u)
/** Alias (User Manual Name) for MCDS_TCXID0_BND.
* To use register names with standard convension, please use MCDS_TCXID0_BND.
*/
#define MCDS_TCXIDBND0 (MCDS_TCXID0_BND)

/** \brief 2C04, Comparator Range Register 0 */
#define MCDS_TCXID0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_RNG*)0xFA012C04u)
/** Alias (User Manual Name) for MCDS_TCXID0_RNG.
* To use register names with standard convension, please use MCDS_TCXID0_RNG.
*/
#define MCDS_TCXIDRNG0 (MCDS_TCXID0_RNG)

/** \brief 2C08, Comparator Mask Register 0 */
#define MCDS_TCXID0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_MSK*)0xFA012C08u)
/** Alias (User Manual Name) for MCDS_TCXID0_MSK.
* To use register names with standard convension, please use MCDS_TCXID0_MSK.
*/
#define MCDS_TCXIDMSK0 (MCDS_TCXID0_MSK)

/** \brief 2C0C, Comparator Sign Register 0 */
#define MCDS_TCXID0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_SGN*)0xFA012C0Cu)
/** Alias (User Manual Name) for MCDS_TCXID0_SGN.
* To use register names with standard convension, please use MCDS_TCXID0_SGN.
*/
#define MCDS_TCXIDSGN0 (MCDS_TCXID0_SGN)

/** \brief 2C10, Comparator Bound Register 1 */
#define MCDS_TCXID1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_BND*)0xFA012C10u)
/** Alias (User Manual Name) for MCDS_TCXID1_BND.
* To use register names with standard convension, please use MCDS_TCXID1_BND.
*/
#define MCDS_TCXIDBND1 (MCDS_TCXID1_BND)

/** \brief 2C14, Comparator Range Register 1 */
#define MCDS_TCXID1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_RNG*)0xFA012C14u)
/** Alias (User Manual Name) for MCDS_TCXID1_RNG.
* To use register names with standard convension, please use MCDS_TCXID1_RNG.
*/
#define MCDS_TCXIDRNG1 (MCDS_TCXID1_RNG)

/** \brief 2C18, Comparator Mask Register 1 */
#define MCDS_TCXID1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_MSK*)0xFA012C18u)
/** Alias (User Manual Name) for MCDS_TCXID1_MSK.
* To use register names with standard convension, please use MCDS_TCXID1_MSK.
*/
#define MCDS_TCXIDMSK1 (MCDS_TCXID1_MSK)

