dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_reg.h
/** \brief 4228, Lookup Table Mapping Register */
#define MCDS_TCYPAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014228u)
/** Alias (User Manual Name) for MCDS_TCYPAL1_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL1_MAP.
*/
#define MCDS_TCYPALMAP1 (MCDS_TCYPAL1_MAP)

/** \brief 4230, Lookup Table Base Register */
#define MCDS_TCYPAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014230u)
/** Alias (User Manual Name) for MCDS_TCYPAL2_BND.
* To use register names with standard convension, please use MCDS_TCYPAL2_BND.
*/
#define MCDS_TCYPALBND2 (MCDS_TCYPAL2_BND)

/** \brief 4234, Lookup Table Range Register */
#define MCDS_TCYPAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014234u)
/** Alias (User Manual Name) for MCDS_TCYPAL2_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL2_RNG.
*/
#define MCDS_TCYPALRNG2 (MCDS_TCYPAL2_RNG)

/** \brief 4238, Lookup Table Mapping Register */
#define MCDS_TCYPAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014238u)
/** Alias (User Manual Name) for MCDS_TCYPAL2_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL2_MAP.
*/
#define MCDS_TCYPALMAP2 (MCDS_TCYPAL2_MAP)

/** \brief 4240, Lookup Table Base Register */
#define MCDS_TCYPAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014240u)
/** Alias (User Manual Name) for MCDS_TCYPAL3_BND.
* To use register names with standard convension, please use MCDS_TCYPAL3_BND.
*/
#define MCDS_TCYPALBND3 (MCDS_TCYPAL3_BND)

/** \brief 4244, Lookup Table Range Register */
#define MCDS_TCYPAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014244u)
/** Alias (User Manual Name) for MCDS_TCYPAL3_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL3_RNG.
*/
#define MCDS_TCYPALRNG3 (MCDS_TCYPAL3_RNG)

/** \brief 4248, Lookup Table Mapping Register */
#define MCDS_TCYPAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014248u)
/** Alias (User Manual Name) for MCDS_TCYPAL3_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL3_MAP.
*/
#define MCDS_TCYPALMAP3 (MCDS_TCYPAL3_MAP)

/** \brief 4400, Comparator Bound Register 0 */
#define MCDS_TCYEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014400u)
/** Alias (User Manual Name) for MCDS_TCYEA0_BND.
* To use register names with standard convension, please use MCDS_TCYEA0_BND.
*/
#define MCDS_TCYEABND0 (MCDS_TCYEA0_BND)

/** \brief 4404, Comparator Range Register 0 */
#define MCDS_TCYEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014404u)
/** Alias (User Manual Name) for MCDS_TCYEA0_RNG.
* To use register names with standard convension, please use MCDS_TCYEA0_RNG.
*/
#define MCDS_TCYEARNG0 (MCDS_TCYEA0_RNG)

/** \brief 4410, Comparator Bound Register 1 */
#define MCDS_TCYEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014410u)
/** Alias (User Manual Name) for MCDS_TCYEA1_BND.
* To use register names with standard convension, please use MCDS_TCYEA1_BND.
*/
#define MCDS_TCYEABND1 (MCDS_TCYEA1_BND)

/** \brief 4414, Comparator Range Register 1 */
#define MCDS_TCYEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014414u)
/** Alias (User Manual Name) for MCDS_TCYEA1_RNG.
* To use register names with standard convension, please use MCDS_TCYEA1_RNG.
*/
#define MCDS_TCYEARNG1 (MCDS_TCYEA1_RNG)

/** \brief 4420, Comparator Bound Register 2 */
#define MCDS_TCYEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014420u)
/** Alias (User Manual Name) for MCDS_TCYEA2_BND.
* To use register names with standard convension, please use MCDS_TCYEA2_BND.
*/
#define MCDS_TCYEABND2 (MCDS_TCYEA2_BND)

/** \brief 4424, Comparator Range Register 2 */
#define MCDS_TCYEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014424u)
/** Alias (User Manual Name) for MCDS_TCYEA2_RNG.
* To use register names with standard convension, please use MCDS_TCYEA2_RNG.
*/
#define MCDS_TCYEARNG2 (MCDS_TCYEA2_RNG)

/** \brief 4430, Comparator Bound Register 3 */
#define MCDS_TCYEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014430u)
/** Alias (User Manual Name) for MCDS_TCYEA3_BND.
* To use register names with standard convension, please use MCDS_TCYEA3_BND.
*/
#define MCDS_TCYEABND3 (MCDS_TCYEA3_BND)

/** \brief 4434, Comparator Range Register 3 */
#define MCDS_TCYEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014434u)
/** Alias (User Manual Name) for MCDS_TCYEA3_RNG.
* To use register names with standard convension, please use MCDS_TCYEA3_RNG.
*/
#define MCDS_TCYEARNG3 (MCDS_TCYEA3_RNG)

/** \brief 4440, Comparator Bound Register 4 */
#define MCDS_TCYEA4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014440u)
/** Alias (User Manual Name) for MCDS_TCYEA4_BND.
* To use register names with standard convension, please use MCDS_TCYEA4_BND.
*/
#define MCDS_TCYEABND4 (MCDS_TCYEA4_BND)

/** \brief 4444, Comparator Range Register 4 */
#define MCDS_TCYEA4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014444u)
/** Alias (User Manual Name) for MCDS_TCYEA4_RNG.
* To use register names with standard convension, please use MCDS_TCYEA4_RNG.
*/
#define MCDS_TCYEARNG4 (MCDS_TCYEA4_RNG)

/** \brief 4450, Comparator Bound Register 5 */
#define MCDS_TCYEA5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014450u)
/** Alias (User Manual Name) for MCDS_TCYEA5_BND.
* To use register names with standard convension, please use MCDS_TCYEA5_BND.
*/
#define MCDS_TCYEABND5 (MCDS_TCYEA5_BND)

/** \brief 4454, Comparator Range Register 5 */
#define MCDS_TCYEA5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014454u)
/** Alias (User Manual Name) for MCDS_TCYEA5_RNG.
* To use register names with standard convension, please use MCDS_TCYEA5_RNG.
*/
#define MCDS_TCYEARNG5 (MCDS_TCYEA5_RNG)

/** \brief 4460, Comparator Bound Register 6 */
#define MCDS_TCYEA6_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014460u)
/** Alias (User Manual Name) for MCDS_TCYEA6_BND.
* To use register names with standard convension, please use MCDS_TCYEA6_BND.
*/
#define MCDS_TCYEABND6 (MCDS_TCYEA6_BND)

/** \brief 4464, Comparator Range Register 6 */
#define MCDS_TCYEA6_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014464u)
/** Alias (User Manual Name) for MCDS_TCYEA6_RNG.
* To use register names with standard convension, please use MCDS_TCYEA6_RNG.
*/
#define MCDS_TCYEARNG6 (MCDS_TCYEA6_RNG)

