dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_reg.h
/** \brief 4818, Event Definition Register 6 */
#define MCDS_TCYEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014818u)

/** \brief 481C, Event Definition Register 7 */
#define MCDS_TCYEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA01481Cu)

/** \brief 4820, Event Definition Register 8 */
#define MCDS_TCYEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014820u)

/** \brief 4824, Event Definition Register 9 */
#define MCDS_TCYEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014824u)

/** \brief 4828, Event Definition Register 10 */
#define MCDS_TCYEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014828u)

/** \brief 482C, Event Definition Register 11 */
#define MCDS_TCYEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA01482Cu)

/** \brief 4830, Event Definition Register 12 */
#define MCDS_TCYEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014830u)

/** \brief 4834, Event Definition Register 13 */
#define MCDS_TCYEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014834u)

/** \brief 4838, Event Definition Register 14 */
#define MCDS_TCYEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014838u)

/** \brief 483C, Event Definition Register 15 */
#define MCDS_TCYEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA01483Cu)

/** \brief 4880, Action Definition Register 0 */
#define MCDS_TCYACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014880u)

/** \brief 4884, Action Definition Register 1 */
#define MCDS_TCYACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014884u)

/** \brief 4888, Action Definition Register 2 */
#define MCDS_TCYACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014888u)

/** \brief 488C, Action Definition Register 3 */
#define MCDS_TCYACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA01488Cu)

/** \brief 4890, Action Definition Register 4 */
#define MCDS_TCYACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014890u)

/** \brief 4894, Action Definition Register 5 */
#define MCDS_TCYACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014894u)

/** \brief 4898, Action Definition Register 6 */
#define MCDS_TCYACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014898u)

/** \brief 489C, Action Definition Register 7 */
#define MCDS_TCYACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA01489Cu)

/** \brief 48A0, Action Definition Register 8 */
#define MCDS_TCYACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148A0u)

/** \brief 48A4, Action Definition Register 9 */
#define MCDS_TCYACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148A4u)

/** \brief 48A8, Action Definition Register 10 */
#define MCDS_TCYACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148A8u)

/** \brief 48AC, Action Definition Register 11 */
#define MCDS_TCYACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148ACu)

/** \brief 48B0, Action Definition Register 12 */
#define MCDS_TCYACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148B0u)

/** \brief 48B4, Action Definition Register 13 */
#define MCDS_TCYACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148B4u)

/** \brief 48B8, Action Definition Register 14 */
#define MCDS_TCYACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148B8u)

/** \brief 48BC, Action Definition Register 15 */
#define MCDS_TCYACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148BCu)

/** \brief 48C0, Action Definition Register 16 */
#define MCDS_TCYACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148C0u)

/** \brief 48C4, Action Definition Register 17 */
#define MCDS_TCYACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148C4u)

/** \brief 48C8, Action Definition Register 18 */
#define MCDS_TCYACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148C8u)

/** \brief 48CC, Action Definition Register 19 */
#define MCDS_TCYACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148CCu)

/** \brief 48D0, Action Definition Register 20 */
#define MCDS_TCYACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148D0u)

/** \brief 48D4, Action Definition Register 21 */
#define MCDS_TCYACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148D4u)

/** \brief 48D8, Action Definition Register 22 */
#define MCDS_TCYACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148D8u)

/** \brief 48DC, Action Definition Register 23 */
#define MCDS_TCYACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148DCu)

/** \brief 4C00, Comparator Bound Register 0 */
#define MCDS_TCYID0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_BND*)0xFA014C00u)
/** Alias (User Manual Name) for MCDS_TCYID0_BND.
* To use register names with standard convension, please use MCDS_TCYID0_BND.
*/
#define MCDS_TCYIDBND0 (MCDS_TCYID0_BND)

/** \brief 4C04, Comparator Range Register 0 */
#define MCDS_TCYID0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_RNG*)0xFA014C04u)
/** Alias (User Manual Name) for MCDS_TCYID0_RNG.
* To use register names with standard convension, please use MCDS_TCYID0_RNG.
*/
#define MCDS_TCYIDRNG0 (MCDS_TCYID0_RNG)

/** \brief 4C08, Comparator Mask Register 0 */
#define MCDS_TCYID0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_MSK*)0xFA014C08u)
/** Alias (User Manual Name) for MCDS_TCYID0_MSK.
* To use register names with standard convension, please use MCDS_TCYID0_MSK.
*/
#define MCDS_TCYIDMSK0 (MCDS_TCYID0_MSK)

/** \brief 4C0C, Comparator Sign Register 0 */
#define MCDS_TCYID0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_SGN*)0xFA014C0Cu)
/** Alias (User Manual Name) for MCDS_TCYID0_SGN.
* To use register names with standard convension, please use MCDS_TCYID0_SGN.
*/
#define MCDS_TCYIDSGN0 (MCDS_TCYID0_SGN)

/** \brief 4C10, Comparator Bound Register 1 */
#define MCDS_TCYID1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_BND*)0xFA014C10u)
/** Alias (User Manual Name) for MCDS_TCYID1_BND.
* To use register names with standard convension, please use MCDS_TCYID1_BND.
*/
#define MCDS_TCYIDBND1 (MCDS_TCYID1_BND)

/** \brief 4C14, Comparator Range Register 1 */
#define MCDS_TCYID1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_RNG*)0xFA014C14u)
/** Alias (User Manual Name) for MCDS_TCYID1_RNG.
* To use register names with standard convension, please use MCDS_TCYID1_RNG.
*/
#define MCDS_TCYIDRNG1 (MCDS_TCYID1_RNG)

/** \brief 4C18, Comparator Mask Register 1 */
#define MCDS_TCYID1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_MSK*)0xFA014C18u)
/** Alias (User Manual Name) for MCDS_TCYID1_MSK.
* To use register names with standard convension, please use MCDS_TCYID1_MSK.
*/
#define MCDS_TCYIDMSK1 (MCDS_TCYID1_MSK)

/** \brief 4C1C, Comparator Sign Register 1 */
#define MCDS_TCYID1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_SGN*)0xFA014C1Cu)
/** Alias (User Manual Name) for MCDS_TCYID1_SGN.
* To use register names with standard convension, please use MCDS_TCYID1_SGN.
*/
#define MCDS_TCYIDSGN1 (MCDS_TCYID1_SGN)

