dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_reg.h
/** \brief 8534, Comparator Range Register 3 */
#define MCDS_TCZAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_RNG*)0xFA018534u)
/** Alias (User Manual Name) for MCDS_TCZAC3_RNG.
* To use register names with standard convension, please use MCDS_TCZAC3_RNG.
*/
#define MCDS_TCZACRNG3 (MCDS_TCZAC3_RNG)

/** \brief 8538, Comparator Mask Register 3 */
#define MCDS_TCZAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZAC_MSK*)0xFA018538u)
/** Alias (User Manual Name) for MCDS_TCZAC3_MSK.
* To use register names with standard convension, please use MCDS_TCZAC3_MSK.
*/
#define MCDS_TCZACMSK3 (MCDS_TCZAC3_MSK)

/** \brief 8580, DTU FIFOs Fill Level */
#define MCDS_TCZDTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZDTUFLV*)0xFA018580u)

/** \brief 8800, Event Definition Register 0 */
#define MCDS_TCZEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018800u)

/** \brief 8804, Event Definition Register 1 */
#define MCDS_TCZEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018804u)

/** \brief 8808, Event Definition Register 2 */
#define MCDS_TCZEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018808u)

/** \brief 880C, Event Definition Register 3 */
#define MCDS_TCZEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA01880Cu)

/** \brief 8810, Event Definition Register 4 */
#define MCDS_TCZEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018810u)

/** \brief 8814, Event Definition Register 5 */
#define MCDS_TCZEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018814u)

/** \brief 8818, Event Definition Register 6 */
#define MCDS_TCZEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018818u)

/** \brief 881C, Event Definition Register 7 */
#define MCDS_TCZEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA01881Cu)

/** \brief 8820, Event Definition Register 8 */
#define MCDS_TCZEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018820u)

/** \brief 8824, Event Definition Register 9 */
#define MCDS_TCZEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018824u)

/** \brief 8828, Event Definition Register 10 */
#define MCDS_TCZEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018828u)

/** \brief 882C, Event Definition Register 11 */
#define MCDS_TCZEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA01882Cu)

/** \brief 8830, Event Definition Register 12 */
#define MCDS_TCZEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018830u)

/** \brief 8834, Event Definition Register 13 */
#define MCDS_TCZEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018834u)

/** \brief 8838, Event Definition Register 14 */
#define MCDS_TCZEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA018838u)

/** \brief 883C, Event Definition Register 15 */
#define MCDS_TCZEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEVT*)0xFA01883Cu)

/** \brief 8880, Action Definition Register 0 */
#define MCDS_TCZACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA018880u)

/** \brief 8884, Action Definition Register 1 */
#define MCDS_TCZACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA018884u)

/** \brief 8888, Action Definition Register 2 */
#define MCDS_TCZACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA018888u)

/** \brief 888C, Action Definition Register 3 */
#define MCDS_TCZACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA01888Cu)

/** \brief 8890, Action Definition Register 4 */
#define MCDS_TCZACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA018890u)

/** \brief 8894, Action Definition Register 5 */
#define MCDS_TCZACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA018894u)

/** \brief 8898, Action Definition Register 6 */
#define MCDS_TCZACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA018898u)

/** \brief 889C, Action Definition Register 7 */
#define MCDS_TCZACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA01889Cu)

/** \brief 88A0, Action Definition Register 8 */
#define MCDS_TCZACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188A0u)

/** \brief 88A4, Action Definition Register 9 */
#define MCDS_TCZACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188A4u)

/** \brief 88A8, Action Definition Register 10 */
#define MCDS_TCZACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188A8u)

/** \brief 88AC, Action Definition Register 11 */
#define MCDS_TCZACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188ACu)

/** \brief 88B0, Action Definition Register 12 */
#define MCDS_TCZACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188B0u)

/** \brief 88B4, Action Definition Register 13 */
#define MCDS_TCZACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188B4u)

/** \brief 88B8, Action Definition Register 14 */
#define MCDS_TCZACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188B8u)

/** \brief 88BC, Action Definition Register 15 */
#define MCDS_TCZACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188BCu)

/** \brief 88C0, Action Definition Register 16 */
#define MCDS_TCZACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188C0u)

/** \brief 88C4, Action Definition Register 17 */
#define MCDS_TCZACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188C4u)

/** \brief 88C8, Action Definition Register 18 */
#define MCDS_TCZACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188C8u)

/** \brief 88CC, Action Definition Register 19 */
#define MCDS_TCZACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188CCu)

/** \brief 88D0, Action Definition Register 20 */
#define MCDS_TCZACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188D0u)

/** \brief 88D4, Action Definition Register 21 */
#define MCDS_TCZACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188D4u)

/** \brief 88D8, Action Definition Register 22 */
#define MCDS_TCZACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188D8u)

